Project2/design.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Design of Project2</title>
<!-- 2018-03-12 Mon 20:04 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Jiashuai Lu" />
</head>
<body>
<div id="content">
<h1 class="title">Design of Project2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Which Semaphores are Needed</a></li>
<li><a href="#sec-2">2. Pseudocodes</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Which Semaphores are Needed</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Nursecall
<ul class="org-ul">
<li>Nurse call patient
</li>
<li>One for each doctor
</li>
<li>Init by 0
</li>
</ul>
</li>
<li>Nursetell
<ul class="org-ul">
<li>Nurse tell doctor
</li>
<li>One for each doctor
</li>
<li>Init by 0
</li>
</ul>
</li>
<li>Patients
<ul class="org-ul">
<li>Patients waiting for register
</li>
<li>One semaphore
</li>
<li>Init by 0
</li>
</ul>
</li>
<li>Symptoms
<ul class="org-ul">
<li>Patients telling doctor their symptoms
</li>
<li>One for each patient
</li>
<li>Init by 0
</li>
</ul>
</li>
<li>Finishadvising
<ul class="org-ul">
<li>Doctor finishing a patient's advising
</li>
<li>One for each patient
</li>
<li>Init by 0
</li>
</ul>
</li>
<li>Waitingfordoctor
<ul class="org-ul">
<li>Denoting there is patient waiting for doctor
</li>
<li>One for each doctor
</li>
<li>Init by 0
</li>
</ul>
</li>
<li>Finishregistering
<ul class="org-ul">
<li>Receptionist finishing a patient's register
</li>
<li>One for each patient
</li>
<li>Init by 0
</li>
</ul>
</li>
<li>Leaves
<ul class="org-ul">
<li>Denote a patient leave status
</li>
<li>One for each patient
</li>
<li>Init by 0
</li>
</ul>
</li>
<li>Mutexes
<ul class="org-ul">
<li>Guarantee some operation to be safe
</li>
<li>two
</li>
<li>Init by 1
</li>
</ul>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Pseudocodes</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-C" id="ClinicSimulator"><span style="color: #ff0000;">/* </span><span style="color: #ff0000;">Clinic Simulator </span><span style="color: #ff0000;">*/</span>
<span style="color: #00ff00;">semaphore</span> <span style="color: #ffff00;">nursecall</span><span style="color: #707183;">[</span>3<span style="color: #707183;">]</span> = <span style="color: #707183;">{</span>0<span style="color: #707183;">}</span>;
<span style="color: #00ff00;">semaphore</span> <span style="color: #ffff00;">nursetell</span><span style="color: #707183;">[</span>3<span style="color: #707183;">]</span> = <span style="color: #707183;">{</span>0<span style="color: #707183;">}</span>;
<span style="color: #00ff00;">semaphore</span> <span style="color: #ffff00;">patients</span> = 0;
<span style="color: #00ff00;">semaphore</span> <span style="color: #ffff00;">symptoms</span><span style="color: #707183;">[</span>30<span style="color: #707183;">]</span> = <span style="color: #707183;">{</span>0<span style="color: #707183;">}</span>;
<span style="color: #00ff00;">semaphore</span> <span style="color: #ffff00;">finish_advising</span><span style="color: #707183;">[</span>30<span style="color: #707183;">]</span> = <span style="color: #707183;">{</span>0<span style="color: #707183;">}</span>;
<span style="color: #00ff00;">semaphore</span> <span style="color: #ffff00;">finish_registering</span><span style="color: #707183;">[</span>30<span style="color: #707183;">]</span> = <span style="color: #707183;">{</span>0<span style="color: #707183;">}</span>;
<span style="color: #00ff00;">semaphore</span> <span style="color: #ffff00;">leaves</span><span style="color: #707183;">[</span>30<span style="color: #707183;">]</span> = <span style="color: #707183;">{</span>0<span style="color: #707183;">}</span>;
<span style="color: #00ff00;">semaphore</span> <span style="color: #ffff00;">waitingfordoctor</span><span style="color: #707183;">[</span>3<span style="color: #707183;">]</span> = <span style="color: #707183;">{</span>0<span style="color: #707183;">}</span>;
<span style="color: #00ff00;">semaphore</span> <span style="color: #ffff00;">mutex1</span> = 1, <span style="color: #ffff00;">mutex2</span> = 1;
<span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">receptionist</span><span style="color: #707183;">()</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">while</span><span style="color: #7388d6;">(</span><span style="color: #ff00ff;">true</span><span style="color: #7388d6;">)</span>
    <span style="color: #7388d6;">{</span>
        wait<span style="color: #909183;">(</span>patients<span style="color: #909183;">)</span>;
        dequeue_patients<span style="color: #909183;">(</span>patient_id<span style="color: #909183;">)</span>;
        assign_doctor_to_patient<span style="color: #909183;">(</span>patient_id<span style="color: #909183;">)</span>;
        signal<span style="color: #909183;">(</span>finish_registering<span style="color: #709870;">[</span>patient_id<span style="color: #709870;">]</span><span style="color: #909183;">)</span>;
        signal<span style="color: #909183;">(</span>receptionist<span style="color: #909183;">)</span>;
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>
<span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">doctor_and_nurse</span><span style="color: #707183;">()</span>
<span style="color: #707183;">{</span>
    <span style="color: #00ffff; font-weight: bold;">while</span><span style="color: #7388d6;">(</span><span style="color: #ff00ff;">true</span><span style="color: #7388d6;">)</span>
    <span style="color: #7388d6;">{</span>
        wait<span style="color: #909183;">(</span>waitingfordoctor<span style="color: #709870;">[</span>doctor_id<span style="color: #709870;">]</span><span style="color: #909183;">)</span>;
        dequeue_patients_of_doctor_id<span style="color: #909183;">(</span>doctor_id, patient_id<span style="color: #909183;">)</span>;
        signal<span style="color: #909183;">(</span>nursecall<span style="color: #709870;">[</span>doctor_id<span style="color: #709870;">]</span><span style="color: #909183;">)</span>;
        wait<span style="color: #909183;">(</span>nursetell<span style="color: #709870;">[</span>doctor_id<span style="color: #709870;">]</span><span style="color: #909183;">)</span>;
        wait<span style="color: #909183;">(</span>symptom<span style="color: #709870;">[</span>patient_id<span style="color: #709870;">]</span><span style="color: #909183;">)</span>;
        advising<span style="color: #909183;">()</span>;
        signal<span style="color: #909183;">(</span>finish_advising<span style="color: #709870;">[</span>patient_id<span style="color: #709870;">]</span><span style="color: #909183;">)</span>;
    <span style="color: #7388d6;">}</span>
<span style="color: #707183;">}</span>
<span style="color: #00ff00;">void</span> <span style="color: #0000ff; font-weight: bold;">patient</span><span style="color: #707183;">()</span>
<span style="color: #707183;">{</span>
    enter_clinic<span style="color: #7388d6;">()</span>;
    wait<span style="color: #7388d6;">(</span>mutex1<span style="color: #7388d6;">)</span>;
    enqueue_patients<span style="color: #7388d6;">(</span>patient_id<span style="color: #7388d6;">)</span>;
    signal<span style="color: #7388d6;">(</span>mutex1<span style="color: #7388d6;">)</span>;
    wait<span style="color: #7388d6;">(</span>finish_registering<span style="color: #909183;">[</span>patient_id<span style="color: #909183;">]</span><span style="color: #7388d6;">)</span>;
    signal<span style="color: #7388d6;">(</span>waitingfordoctor<span style="color: #909183;">[</span>doctor_id<span style="color: #909183;">]</span><span style="color: #7388d6;">)</span>;
    wait<span style="color: #7388d6;">(</span>nursecall<span style="color: #909183;">[</span>doctor_id<span style="color: #909183;">]</span><span style="color: #7388d6;">)</span>;
    walking_to_doctor_office<span style="color: #7388d6;">(</span>doctor_id<span style="color: #7388d6;">)</span>;
    signal<span style="color: #7388d6;">(</span>symptom<span style="color: #909183;">[</span>patient_id<span style="color: #909183;">]</span><span style="color: #7388d6;">)</span>;
    wait<span style="color: #7388d6;">(</span>finish_advising<span style="color: #909183;">[</span>patient_id<span style="color: #909183;">]</span><span style="color: #7388d6;">)</span>;
    leave<span style="color: #7388d6;">()</span>;
    signal<span style="color: #7388d6;">(</span>leaves<span style="color: #909183;">[</span>patient_id<span style="color: #909183;">]</span><span style="color: #7388d6;">)</span>;
<span style="color: #707183;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jiashuai Lu</p>
<p class="date">Created: 2018-03-12 Mon 20:04</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"></p>
</div>
</body>
</html>
